Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/services_for_asylum_seekers_in_ireland/direct_provision.html.txt.tmx
Source language: en
Languages: ga

source: Services and entitlements for people seeking asylum
ga: Seirbhísí agus teidlíochtaí do dhaoine ag lorg tearmainn

source: The Reception and Integration Agency, which is under the Department of Justice and Equality, is responsible for co-ordinating the services provided to asylum seekers in Ireland
ga: Is í an Ghníomhaireacht um Fháiltiú agus Imeascadh, atá faoi choimirce na Roinne Dlí agus Cirt agus Comhionannais, atá freagrach as comhordú na seirbhísí a sholáthraítear d’iarrthóirí tearmainn in Éirinn

source: This is done in partnership with a number of State agencies, voluntary and community groups and other non-governmental organisations
ga: Déantar é seo i gcomhpháirt le roinnt gníomhaireachtaí stáit, grúpaí deonacha agus pobail agus eagrais neamhrialtais

source: On 30 June 2015, the Government published the Report of the Working Group on the Protection Process including Direct Provision and supports to asylum seekers
ga: An 30 Meitheamh 2015, d’fhoilsíodh an Rialtas an Tuarascáil ná Meitheal um Próiseas Cosanta, Soláthar Díreach agus tacaíochtaí d’iarrthóirí tearmainn san áireamh

source: It includes over 170 recommendations, including improvements to the conditions in accommodation for asylum seekers, particularly for families and children
ga: Áirítear níos mó ná 170 molta, feabhsaithe coinníollacha i gcóiríocht d’iarrthóra tearmainn, go mór mór teaghlaigh agus leanaí, san áireamh

source: Services and entitlements available to you
ga: Seirbhísí agus teidlíochtaí atá ar fáil duitse

source: As a newly arrived asylum seeker, you are initially accommodated in a short-stay reception centre in the Dublin area for a period of assessment
ga: Mar iarrthóir tearmainn nua-thagtha, tugtar cóiríocht duit ar dtús i lárionad gearrthéarmach i gceantar Bhaile Átha Cliath ar feadh thréimhse mheasúnachta

source: You will then be assigned accommodation at a regional centre
ga: Tabharfar cóiríocht duit i lárionad réigiúnach ansin

source: Such an assignment will take your particular needs into account
ga: Cuirfidh an dáileadh sin do riachtanais faoi leith san áireamh

source: Your accommodation is full board, which includes bed, breakfast, lunch, and evening meal
ga: Tabharfar cothú iomlán duit i do chóiríocht, lena n-áirítear leaba, bricfeasta, lón agus béile sa tráthnóna

source: This known as direct provision
ga: Tugtar air mar soláthar díreach

source: Each adult will receive a personal allowance of €19.10 per week
ga: Gheobhaidh gach duine fásta liúntas pearsanta de €19.10 in aghaidh na seachtaine

source: Since 7 January 2016 the allowance for a child is €15.60 per week
ga: Ó 7 Eanáir 2016 ardófar an liúntas do gach leanbh go dtí €15.60 in aghaidh na seachtaine

source: You may be entitled to assistance towards clothing when you arrive and to other exceptional needs from time to time
ga: D’fhéadfá a bheith i dteideal cúnaimh d’éadach nuair a thagann tú agus do riachtanais eisceachtúla eile ó am go chéile

source: The Department of Social Protection's representative (formerly known as the Community Welfare Officer) will advise you on this
ga: Tabharfaidh an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) comhairle duit faoin méid seo

source: You will not be entitled to Rent Supplement as your accommodation is paid for
ga: Ní bheidh tú i dteideal Forlíonadh Cíosa óir go n-íoctar as do lóistín

source: The Local Health Office will provide for your medical needs
ga: Freastalóidh an Oifig Sláinte Áitiúil i do cheantarsa ar do riachtanais leighis

source: The Department's representative will provide you with a medical card application form
ga: Soláthróidh ionadaí na Roinne áitiúil foirm iarratais chárta leighis duit

source: The medical card gives you and your family access to medical services free of charge
ga: Tugann an Cárta Leighis rochtain shaor in aisce duit agus do do theaghlach ar sheirbhísí leighis

source: You can read more about medical services for asylum seekers here
ga: Tá tuilleadh eolais faoi seirbhísí leighis d'iarrthóirí tearmainn anseo

source: Primary and post-primary education: Information packs on primary and post-primary education are provided at the initial reception centre in Dublin to the parents of children of school-going age before they are allocated to their regional accommodation centre
ga: Bunoideachas agus iar-bhunoideachas: Soláthraítear pacaí faisnéise bunoideachas agus iar-bhunoideachas ag an lárionad céadfháiltithe i mBaile Átha Cliath do thuismitheoirí na leanaí scoil-aoise sula seoltar chuig a lárionad réigiúnach cóiríochta iad

source: All children and young people, including young asylum seekers, are entitled to free primary and post primary education
ga: Bíonn gach leanbh agus ógánach, lena n-áirítear iarrthóirí tearmainn, i dteideal bunoideachas agus iar-bhunoideachas saor in aisce a fháil

source: All children are required to remain in school until they are 16 years of age
ga: Ní mór do gach leanbh fanacht ar scoil nó go sroicheann siad 16 bliana déag d’aois

source: Most children start school at 4 years of age and continue through primary school until they are approximately 12 years old
ga: Tosaíonn mórchuid na leanaí ar scoil ag aois 4 bliana agus leanann ar aghaidh tríd an mbunscolaíocht nó go mbíonn siad thar ar 12 bhliain déag d’aois

source: Corporal punishment is prohibited in Irish schools
ga: Tá toirmeasc ar an bpíonós corpartha i scoileanna na hÉireann

source: On completing primary education, the students then transfer to post-primary or second-level education (more commonly called secondary education)
ga: Ar chríochnú an bhunoideachais, aistríonn na daltaí ansin chuig an iar-bhunoideachas (nó an dara leibhéal, ar a dtugtar oideachas tánaisteach go minic)

source: They join the junior cycle of secondary education, which lasts 3 years
ga: Téann siad isteach sa timthriall sóisearach den oideachas tánaisteach, a mhaireann ar feadh trí bliana

source: At the end of this cycle students present themselves for the Junior Certificate Examination
ga: Ag deireadh an timthriaill seo cuireann daltaí iad féin chun cinn do Scrúdu an Teastais Shóisearaigh

source: Students then continue into the senior cycle, which lasts two or three years and leads to students presenting for the Leaving Certificate Examination
ga: Leanann na daltaí ar aghaidh isteach sa timthriall sinsearach, a mhaireann ar feadh dhá nó trí cinn de bhlianta agus a threoraíonn na daltaí le tabhairt faoi Scrúdú na hArdteistiméireachta

source: Children may have free access to mother tongue supports
ga: D'fhéadfadh rochtain shaor in aisce a bheith ag leanaí ar thacaíochtaí máthair-theanga

source: Further and higher education: In general, asylum seekers are not entitled to free third-level (university or college) education
ga: Gairmoideachas agus ardoideachas: Go ginearálta, ní bhíonn iarrthóir tearmainn don oideachas tríú leibhéal (ollscoil nó coláiste) saor in aisce

source: Under the Pilot Support Scheme, school leavers who have been in the protection system for 5 years and meet certain criteria can apply for student supports
ga: Faoin Scéim Tacaíochta Píolóta, is féidir fágóirí scoile a bhíonn sa chóras cosanta tearmainn ar feadh 5 bhliain agus a shásaíonn critéir áirithe, iarratas a dhéanamh ar thacaíochtaí mhic léinn

source: Adults may have free access to adult literacy and English language classes
ga: Is féidir rochtain shaor in aisce a bheith ag daoine fásta ar Litearthacht do Dhaoine Fásta agus ar ranganna sa Bhéarla

source: Information on English classes can be obtained from your local Education and Training Board (ETB) or local support group
ga: Is féidir eolas a fháil ar ranganna Béarla ó do Bhord Oideachais agus Oiliúna áitiúil nó ó do ghrúpa tacaíochta áitiúil

source: Work and vocational training
ga: Oiliúint oibre agus ghairmiúil

source: In general, you are not entitled to work or attend vocational training. You may, however, become involved in voluntary community activities
ga: Go ginearálta, ní bhíonn tú i dteideal dul ag obair nó ag freastal ar oiliúint ghairmiúil

source: Interpretation and translation services will be provided where necessary
ga: Féadann tú páirt a ghlacadh i ngníomhaíochtaí deonacha pobail, ámh

source: Local support groups
ga: Seirbhísí teangaireachta agus aistriúcháin

source: Staff of the Agency will hold information meetings at your accommodation centre on a regular basis
ga: Soláthrófar seirbhísí teangaireachta agus aistriúcháin de réir mar is gá

source: If you are living within the direct provision system and you have a complaint, you must first make your complaint to the manager of the accommodation centre
ga: Beidh fáil freisin ar eolas maidir le grúpaí tacaíochta áitiúla éagsúla, ag nó cóngarach do do sprioc athlonnaithe, ach a iarraidh ón Stiúrthóireacht um Sheirbhísí Tacaíochta Tearmainn

source: However, even if more than 12 months has passed, the Ombudsman may still be able to help if there is a good reason for the delay
ga: Reachtálfaidh foireann na Stiúrthóireachta cruinnithe eolais ag do lárionad cóiríochta ar bhonn leanúnach

source: You will be expected to stay at the regional centre while your application for international protection (refugee status or subsidiary protection) is being processed
ga: Beifear ag dúil go bhfanfaidh tú ag an lárionad réigiúnach a fhad agus a bhíonn d’iarratas ar chosaint idirnáisiúnta (stádas dídeanaithe nó fochosaint) á phróiseáil

source: You are not allowed to seek alternative accommodation in the private rented sector during this time
ga: Ní cheadaítear duit cóiríocht mhalartach a lorg ar cíos san earnáil phríobháideach i rith an ama sin

source: If you are absent from your designated accommodation centre for more than 3 consecutive nights, the Reception and Integration Agency will deem your bed space abandoned
ga: Má bhíonn tú as láthair ó d’ionad lóistín ainmnithe ar feadh tréimhse níos faide ná 3 oíche i ndiaidh a chéile, cinnfidh an Ghníomhaireacht um Fháiltiú agus Imeascadh (GFI), go mbíonn do spás leapa tréigthe

source: Continuous absenteeism (that is, for 3 or more nights) will be taken as an indication that you do not wish to receive any aid or assistance from the Agency
ga: Tuigfear leis an neamhláithreacht leanúnach (is é sin, ar feadh 3 óiche nó níos mó) nach mian leat aon chabhair ná cúnamh a fháil ón Ghníomhaireacht

source: House rules are posted in each accommodation centre
ga: Postaítear rialacha an tí i ngach aon lárionad lóistín

source: While you are a resident in the centre, you will be expected to abide by these rules
ga: Beifear ag dúil uait go gcloífidh tú leis na rialacha siúd a fhad agus a bhíonn tú i do chónaí sa lárionad féin

source: You can find the House Rules and Procedures booklet (pdf) including complaints procedures on the Agency's website
ga: Tá na rialacha tí GFI agus nós imeachta le gearáin a dhéanamh (pdf) ar fáil ar an suíomh gréasáin na Gníomhaireachta

source: It is the responsibility of parents to supervise and care for their children
ga: Is í freagracht na dtuismitheoirí í cúram a thabhairt dá gcuid leanaí agus iad a mhaoirsiú

source: To ensure the safety of the children and for the safety of others, it is not permissible to leave children unattended at the accommodation centres
ga: Ní ceadmhach é, d’fhonn shábháilteacht na leanaí agus na ndaoine eile a chinntiú, chun leanaí a fhágáil gan chúram ag na lár-ionaid lóistín

source: Failure to care for and ensure the safety of your children may require the the involvement of the Child and Family Agency, which is obliged, under the Child Care Act 1991, as amended by the Child and Family Agency Act 2013, to ensure the welfare and protection of children in its area
ga: D’fhéadfadh baint a bheith ag an Oifig Sláinte Áitiúil leis an gcás, a mbíonn cúram acu faoin Acht um Chúram Leanaí 1991, arna leasú leis an Acht fán nGníomhaireacht um Leanaí agus an Teaghlach 2013 , má theipeann ort cúram a thabhairt do do leanaí agus chun a sábháilteacht a chinntiú

source: Your application for international protection will be processed while you are living at your allocated accommodation
ga: Próiseálfar d’iarratas ar stádas teifigh a fhad agus a bhíonn tú i do chónaí ag an lóistín a dáileadh chugat

source: The International Protection Office will provide you with an information leaflet on the procedures involved in processing asylum claims
ga: Soláthróidh Oifig um Chosaint Idirnáisiúnta bileog eolais duit um na nósanna imeachta a bhaineann le próiseáil na n-éileamh tearmainn

source: Contact the Department of Social Protection's representative at your local health centre
ga: Déan teagmháil leis an t-ionadaí Roinne Coimirce Sóisialaí i d'ionad sláinte áitiúil
